import random
import string

def generate_random_nickname():
    words = [
        '비행기', '자동차', '배', '자전거', '기차', '버스', '헬리콥터', '풍선', '연', '배트맨',
        '슈퍼맨', '아이언맨', '토르', '헐크', '캡틴', '스파이더맨', '윈터솔저', '블랙팬서', '앤트맨', '닥터스트레인지',
        '가디언즈', '스칼렛', '위도우', '호크아이', '팔콘', '로키', '스타로드', '로켓', '그루트', '드랙스', '맨티스',
        '네뷸라', '감모라', '캡틴마블', '워머신', '킬몽거', '에이전트', '실버서퍼', '고스트라이더', '데드풀', '엑스맨',
        '스톰', '울버린', '사이클롭스', '제한', '다크피닉스', '퓨처파이트', '블레이드', '문나이트', '마일즈', '모라레스',
        '스파이더그웬', '벤옴', '카니지', '리자드', '일렉트로', '닥터옥토퍼스', '미스테리오', '샌드맨', '크레이븐', '스콜피온',
        '그린고블린', '호버', '시니스터', '식스', '엘리멘탈', '드라큘라', '프랑켄슈타인', '늑대인간', '미라', '드라쿨라'
    ]
    word = random.choice(words)
    suffix = ''.join(random.choices(string.ascii_letters + string.digits, k=3))
    return f'{word}{suffix}'
